# 所有选项除了注明外，填写True/False
# 基础设置
# ***************************************************************************************************************
uid = ""
# kysdm巨佬的api，自动化鉴权脚本，自动获取passkey https://greasyfork.org/zh-CN/scripts/428545
token = ""
# u2的cookie,从iyuu复制就行，下载种子用
cookie = ""
# 脚本运行间隔（每n小时运行一次）
interval = 24

# 连接设置
# ***************************************************************************************************************
# qb webui
CLIENT_IP = '192.168.2.177'
CLIENT_PORT = 8080
CLIENT_USER = 'admin'
CLIENT_PASSWORD = 'adminadmin'

# 针对幼儿园需要代理访问的情况
proxy = False
proxies = {'http': "127.0.0.1:1080",
           'https': "127.0.0.1:1080"}
# SSL 我这网太差了才关的，能用就尽量True
verify = True
header = {
    'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) ApplewebKit/537.36 (KHtml, like Gecko) Chrome/80.0.3987.163 Safari/537.36',
}
# 日志等级，默认INFO,嫌吵改成WARN（大写）
level = "INFO"

# 全局种子筛选设置
# ***************************************************************************************************************
# 是否只保BDMV/DVDISO
BDMV = True
# 孤种筛选条件（最小/最大做种人数）、容量（G）
minimum = 1
maximum = 2
size = 100

# 下载设置
# 设为False后，就变成只给大家放魔、自己不下载刷流的福利脚本
down = True
# ***************************************************************************************************************
# 非Free种且设置不放魔法时，是否头铁硬上（会产生下载量！！！）
tou_tie = False
# 添加种子时，是否默认暂停（不自动开始下载）
paused = False
# 保存路径(如果是docker，则为容器内相对路径),add_id打开之后，路径会变成/save_path/种子id/种子名，套了一层名为id的文件夹（不明白默认False就可）
add_id = False
save_path = "/downloads/save_torrents"
# 每次下载数量
download_num = 2

# 魔法开关
magic = True
# ***************************************************************************************************************
# 每次最大花费（每金为10000），魔法持续时间最低24，生效范围"ALL"/"SELF"
max_cost = 15000
magic_hours = 24
magic_scope = "ALL"
# 蹭魔法有效期（蹭大佬的全局魔法，剩余n小时以上就蹭，否则自己释放，防止时间不够下载）
free_hours = 12
# 自定义为True时，按以下规则填写上传、下载率并释放魔法；为False时，释放普通Free魔法（上传1.00，下载0.00）
customize = True
# 上传率1.3~2.33，下载0~0.8（摘抄自网站魔法页面，自定义时不支持1.0倍上传）
upload_ratio = 2.33
download_ratio = 0.00
